#Использовать asserts
#Использовать ".."

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("ТестДолжен_ПроверитьЧтоДваПлюсДваРавноЧетыре");
	ВсеТесты.Добавить("ТестДолжен_ПроверитьСложениеДвухЧиселВПапмяти");

	Возврат ВсеТесты;
КонецФункции

Процедура ПередЗапускомТеста() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТестов() Экспорт
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьЧтоДваПлюсДваРавноЧетыре() Экспорт
	Результат = Вычислитель.Сложить(2, 2);
	Ожидаем.Что(Результат, "Ожидаем, что 2 + 2 = 4").Равно(4);
КонецПроцедуры

Процедура ТестДолжен_ПроверитьСложениеДвухЧиселВПапмяти() Экспорт
	ЧислоВПамяти1 = Новый ЧислоВПамяти(1);
	ЧислоВПамяти2 = Новый ЧислоВПамяти(3);

	Результат = Вычислитель.Сложить(ЧислоВПамяти1, ЧислоВПамяти2);
	Ожидаем.Что(Результат, "Ожидаем, что сложение чисел в памяти работает").Равно(4);
КонецПроцедуры