#Использовать asserts
#Использовать ".."

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("ТестДолжен_ПроверитьСохранениеЗначенияЧислоВПамяти");

	Возврат ВсеТесты;
КонецФункции

Процедура ПередЗапускомТестов() Экспорт
	
КонецПроцедуры

Процедура ПослеЗапускаТестов() Экспорт
	
КонецПроцедуры

Процедура ТестДолжен_ПроверитьСохранениеЗначенияЧислоВПамяти() Экспорт
	ЧислоВПамяти = Новый ЧислоВПамяти(10);

	Ожидаем.Что(
		ЧислоВПамяти.Получить(),
		"Ожидаем, что число 10 сохранилось в памяти объекта ЧислоВПамяти"
	).Равно(10);
КонецПроцедуры